"""Задача 1

Вывод текста на экран

Задание:

Напишите программу, которая выводит на экран строку "Привет, мир!".

Ответ:"""

print("Привет, мир!")