"""
Задача 14

Среднее арифметическое

Задание:

Попросите пользователя ввести три числа и вычислите их среднее арифметическое.

Ответ:"""

num1 = float(input("Введите первое число: "))
num2 = float(input("Введите второе число: "))
num3 = float(input("Введите третье число: "))

average = (num1 + num2 + num3) / 3
print("Среднее арифметическое:", average)
