"""
Задача 17

Объём куба

Задание:

Запросите у пользователя длину ребра куба и вычислите его объём.

Ответ:"""

edge = float(input("Введите длину ребра куба: "))
volume = edge ** 3
print("Объем куба:", volume)
