"""

Задача 2

Ввод данных от пользователя

Задание:

Запросите у пользователя его имя и выведите сообщение: "Здравствуйте, <имя>!".

Ответ:
"""
name = input("Введите ваше имя: ")
print("Здравствуйте, " + name + "!")