"""
Задача 27

Число в обратном порядке

Задание:

Запросите у пользователя целое число и выведите его цифры в обратном порядке.

Ответ:"""

number = input("Введите целое число: ")
reversed_number = number[::-1]
print("Число в обратном порядке:", reversed_number)
