"""
Задача 3

Сложение чисел

Задание:

Попросите пользователя ввести два числа и выведите их сумму.

Ответ:
"""
num1 = float(input("Введите первое число: "))
num2 = float(input("Введите второе число: "))
sum = num1 + num2
print("Сумма чисел:", sum)