"""
Задача 54

Конвертация чисел в римские цифры

Задание:

Попросите пользователя ввести число от 1 до 3999 и преобразуйте его в римское число.

Ответ:"""

num = int(input("Введите число от 1 до 3999: "))

if not 1 <= num <= 3999:
    print("Число некорректное")
else:
    val = [
        1000, 900, 500, 400,
        100, 90, 50, 40,
        10, 9, 5, 4, 1
    ]
    syms = [
        "M",  "CM", "D", "CD",
        "C",  "XC", "L", "XL",
        "X",  "IX", "V", "IV", "I"
    ]
    roman_num = ''
    i = 0
    while num > 0:
        for _ in range(num // val[i]):
            roman_num += syms[i]
            num -= val[i]
        i += 1
    print("Римское число:", roman_num)
