"""
Задача 6

Возведение в степень

Задание:

Запросите у пользователя число и выведите его квадрат и куб.

Ответ:"""
num = float(input("Введите число: "))
print("Квадрат числа:", num ** 2)
print("Куб числа:", num ** 3)
