"""
Задача 7

Конкатенация строк

Задание:

Попросите пользователя ввести имя и фамилию, объедините их и выведите полное имя.

Ответ:"""
first_name = input("Введите имя: ")
last_name = input("Введите фамилию: ")
full_name = first_name + " " + last_name
print(full_name)
