"""
Задача 8

Вычисление площади круга

Задание:

Запросите у пользователя радиус круга и вычислите его площадь. Используйте π = 3.14.

Ответ:"""
radius = float(input("Введите радиус круга: "))
area = 3.14 * radius ** 2
print("Площадь круга:", area)
